In [1]:
import pandas as pd
import numpy as np

# PANelDAtaS

- 데이터 분석
- 시계열이나 표를 다루기 위한 Series 클래스와 DataFrame 클래스 제공
-> 숫자 테이블과 시계열을 조작하기 위한 데이터 구조와 연산 제공

# pd.Series()

In [ ]:
#시리즈 만들기

a = '하나 둘 셋 넷 다섯 여섯 일곱 여덟 아홉 열'
series = pd.Series(a.split(' '), index=[_ for _ in range(1, 11)])
series_withoutindex = pd.Series(a.split(' '))       #0부터 인덱스 저장장
print(series)
print(series_withoutindex) 
print(series.index)
print(series.values)

1     하나
2      둘
3      셋
4      넷
5     다섯
6     여섯
7     일곱
8     여덟
9     아홉
10     열
dtype: object
0    하나
1     둘
2     셋
3     넷
4    다섯
5    여섯
6    일곱
7    여덟
8    아홉
9     열
dtype: object
Index([1, 2, 3, 4, 5, 6, 7, 8, 9, 10], dtype='int64')
['하나' '둘' '셋' '넷' '다섯' '여섯' '일곱' '여덟' '아홉' '열']

In [11]:
#시리즈에 인덱스 달기
series = pd.Series(range(10,100, 10))
series

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [19]:
#s.name = str

s = pd.Series([9_904_312, 3_448_737, 2_890_451, 2_466_052],
              index=["서울", "부산", "인천", "대구"])
print(f"s.index = {s.index}")
print(f"s.values = {s.values}")
s.name = '인구'
s.index.name = '도시'
print(s)

s.index = Index(['서울', '부산', '인천', '대구'], dtype='object')
s.values = [9904312 3448737 2890451 2466052]
도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [23]:
# 딕셔너리로 시리즈 생성

d = {'a':1, 'b':2, 'c':3}
ser = pd.Series(data=d, index=['a','b','c'])
print(ser)
ser = pd.Series(data=d, index=['x','y','z'])
print(ser)
ser = pd.Series(data=d)     #딕셔너리를 넣으면 인덱스를 입력하지 않아도 키값으로 인덱스를 설정정
print(ser)

a    1
b    2
c    3
dtype: int64
x   NaN
y   NaN
z   NaN
dtype: float64
a    1
b    2
c    3
dtype: int64

In [28]:
#series.label -> 인덱스를 속성처럼 사용하기
d = {'a':1, 'b':2, 'c':3}
ser = pd.Series(data=d, index=['a','b','c'])
print(ser.b)

2

In [132]:
# 시리즈 생성 연습문제
name = '철수 영희 길동 몽룡'
ser = pd.Series([88, 95, 100, 67], index = name.split(' '))
print(ser)

철수     88
영희     95
길동    100
몽룡     67
dtype: int64

In [32]:
#시리즈에서의 딕셔너리 메서드

s = pd.Series([9_904_312, 3_448_737, 2_890_451, 2_466_052],
              index=["서울", "부산", "인천", "대구"])

print(('서울'in s))
print(('대전'in s))
for k, v in s.items():
    print(f'{k}, {v}')

True
False
서울, 9904312
부산, 3448737
인천, 2890451
대구, 2466052

In [33]:
#연습문제
s = pd.Series([9_904_312, 3_448_737, 2_890_451, 2_466_052],
              index=["서울", "부산", "인천", "대구"])
for k, v in s.items():
    if v >= 3000000 :
        print(f'{k}의 인구는 300만이 넘습니다.')

서울의 인구는 300만이 넘습니다.
부산의 인구는 300만이 넘습니다.

In [34]:
#시리즈의 벡터화 연산
s = pd.Series([9_904_312, 3_448_737, 2_890_451, 2_466_052],
              index=["서울", "부산", "인천", "대구"])

s/1000000

서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
dtype: float64

In [58]:
# 시리즈 인덱싱
s = pd.Series([9_904_312, 3_448_737, 2_890_451, 2_466_052],
              index=["서울", "부산", "인천", "대구"])


print(s.iloc[1], s['부산'])
print(s.iloc[1:3])
print(s['부산':'대구'])

3448737 3448737
부산    3448737
인천    2890451
dtype: int64
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [81]:
#시리즈 객체에서의 연산, null값인지 확인
# 첫 번째 Series 생성
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])

# 두 번째 Series 생성
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158})

ds = s - s2     #연산이 불가능한 객체는 결측치, NaN 값은 float 자료형에서만 표현 가능 -> 다른 결과도 float 자료형으로 변환

print(ds)

print(ds.isnull())

for k, v in ds.notnull().items():
    if v:
        print(k)

ds[ds.notnull()]

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64
대구     True
대전     True
부산    False
서울    False
인천    False
dtype: bool
부산
서울
인천

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [118]:
# notnull()을 이용하여 값이 있는 것만 출력

s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])

# 두 번째 Series 생성
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158})

ds = s - s2 
print(ds)
print(ds.notnull())
ds[ds.notnull()]

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64
대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

272830.0

In [134]:
# 증가값과 인구수 증가가 가장 많은 도시 출력

s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])

s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158})


# 내 풀이
print(max(ds[ds.notnull()]))

#답지?
ds = s - s2 
ds = ds[ds.notnull()]

print(ds.iloc[ds.values.argmax()])
print(ds.index[ds.values.argmax()])

272830.0
272830.0
서울

# 데이터프레임

열과 행을 갖는 데이터 구조 -> 2차원 데이터 구조

In [153]:
# 데이터프레임 만들기

d = {'col1' : [1,2], 'col2' : [3,4]}

df = pd.DataFrame(data=d, index=('row1', 'row2'))
df

      col1  col2
row1     1     3
row2     2     4

In [151]:
# 복잡한 데이터프레임 !

data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df.index.name = '도시'
df.columns.name = '특성'
print('df :\n',df)
print('df.values :\n',df.values)
print('df.columns :\n',df.columns)
print('df.index :\n',df.index)

df :
 특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141
df.values :
 [['수도권' 9904312 9631482 9762546 9853972 0.0283]
 ['경상권' 3448737 3393191 3512547 3655437 0.0163]
 ['수도권' 2890451 2632035 2517680 2466338 0.0982]
 ['경상권' 2466052 2431774 2456016 2473990 0.0141]]
df.columns :
 Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object', name='특성')
df.index :
 Index(['서울', '부산', '인천', '대구'], dtype='object', name='도시')

In [199]:
#컬럼 단위로 접근
print(type(df['2015']))
print(df['2015'])
print()
print(type(df[['2015']]))
print(df[['2015']])
print()


# 행으로 접근하는 방법!!
print('<<행으로 접근>>')
print('df[:1]\n',df[:1])
print()
print('df[1:3]\n',df[1:3])
print()
print("df['부산':'부산']\n",df['부산':'부산'])
print()


#열과 행으로 접근하는 방법!!
print("df['2005']['서울']\n", df['2005']['서울'])

<class 'pandas.core.series.Series'>
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 2015, dtype: int64

<class 'pandas.core.frame.DataFrame'>
       2015
서울  9904312
부산  3448737
인천  2890451
대구  2466052

<<행으로 접근>>
df[:1]
      지역     2015     2010     2005     2000  2005-2010 증가율
서울  수도권  9904312  9631482  9762546  9853972      -1.342519

df[1:3]
      지역     2015     2010     2005     2000  2005-2010 증가율
부산  경상권  3448737  3393191  3512547  3655437      -3.397990
인천  수도권  2890451  2632035  2517680  2466338       4.542078

df['부산':'부산']
      지역     2015     2010     2005     2000  2005-2010 증가율
부산  경상권  3448737  3393191  3512547  3655437       -3.39799

df['2005']['서울']
 9762546

In [142]:
d = [[1,2],[3,4]]

df = pd.DataFrame(data=d, index=('row1', 'row2'), columns =('col1','col2'))
df

      col1  col2
row1     1     2
row2     3     4

In [196]:
# 값 갱신, 컬럼 추가, 삭제

data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)


# 원래 있던 컬럼의 값 갱신
df['2010-2015 증가율'] = df['2010-2015 증가율']*100

# 새로운 컬럼 추가
df['2005-2010 증가율'] = (df['2010'] - df['2005'])/(df['2005'])*100

# 컬럼 삭제
del df['2010-2015 증가율']
df

#컬럼 단위로 접근
print(type(df['2015']))
print(df['2015'])
print()
print(type(df[['2015']]))
print(df[['2015']])
print()


# 행으로 접근하는 방법!!
print('df[:1]\n',df[:1])
print()
print('df[1:3]\n',df[1:3])
print()
print("df['부산':'부산']\n",df['부산':'부산'])
print()
print("df['2005']['서울']\n", df['2005']['서울'])

<class 'pandas.core.series.Series'>
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 2015, dtype: int64

<class 'pandas.core.frame.DataFrame'>
       2015
서울  9904312
부산  3448737
인천  2890451
대구  2466052

df[:1]
      지역     2015     2010     2005     2000  2005-2010 증가율
서울  수도권  9904312  9631482  9762546  9853972      -1.342519

df[1:3]
      지역     2015     2010     2005     2000  2005-2010 증가율
부산  경상권  3448737  3393191  3512547  3655437      -3.397990
인천  수도권  2890451  2632035  2517680  2466338       4.542078

df['부산':'부산']
      지역     2015     2010     2005     2000  2005-2010 증가율
부산  경상권  3448737  3393191  3512547  3655437       -3.39799

df['2005]['서울']
 9762546

In [173]:
# 시리즈와 데이터프레임

print(type(df['2015']))
print(df['2015'])
print()
print(type(df[['2015']]))
print(df[['2015']])

<class 'pandas.core.series.Series'>
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 2015, dtype: int64

<class 'pandas.core.frame.DataFrame'>
       2015
서울  9904312
부산  3448737
인천  2890451
대구  2466052

In [181]:
#2차원 배열로 데이터 프레임 만들기

pd.DataFrame(np.arange(12).reshape(3,4), columns='col1 col2 col3 col4'.split(' '), index='row1 row2 row3'.split(' '))

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11

In [236]:
# 데이터프레임 연습문제

data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]

df = pd.DataFrame(data=data, columns=columns, index=index)
df['수학']

print(df[['국어', '영어']])

df['평균'] = (df['국어']+df['수학']+df['영어'])/3

print(df['춘향':'춘향'])


#시리즈로 출력 df.T로 전치해서 출력!!
print(df.T['향단'])

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40
    국어  영어  수학         평균
춘향  80  90  90  86.666667
국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

# 파일 관리

In [250]:
# pd.to_csv('파일명', index = False) -> csv 파일로 저장

data = np.array('1 1.11 one 2 '' two 누락 3.33 three'.split(' ')).reshape(3,3)
df_csv = pd.DataFrame(data=data, columns='c1 c2 c3'.split(' '))
df_csv
df_csv.to_csv('sample1.csv', index=False)

   c1    c2     c3
0   1  1.11    one
1   2          two
2  누락  3.33  three

In [253]:
# pd.read_csv('파일명') -> csv 파일 불러오기

df_read = pd.read_csv('sample1.csv')
df_read

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

In [256]:
pokemon = pd.read_csv('pokemon.csv')
pokemon

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
795,719,Diancie,Rock,Fairy,600,50,100,150,100,150,50,6,True
796,719,DiancieMega Diancie,Rock,Fairy,700,50,160,110,160,110,110,6,True
797,720,HoopaHoopa Confined,Psychic,Ghost,600,80,110,60,150,130,70,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,680,80,160,60,170,130,80,6,True
799,721,Volcanion,Fire,Water,600,80,110,120,130,90,70,6,True

In [268]:
titanic = pd.read_csv("https://storage.googleapis.com/tf-datasets/titanic/train.csv")
titanic.head()
titanic.tail(10)
titanic.nunique()
titanic.count()
titanic.dtypes
titanic['survived'].value_counts(normalize=True)
titanic.describe()

         survived         age  n_siblings_spouses       parch        fare
count  627.000000  627.000000          627.000000  627.000000  627.000000
mean     0.387560   29.631308            0.545455    0.379585   34.385399
std      0.487582   12.511818            1.151090    0.792999   54.597730
min      0.000000    0.750000            0.000000    0.000000    0.000000
25%      0.000000   23.000000            0.000000    0.000000    7.895800
50%      0.000000   28.000000            0.000000    0.000000   15.045800
75%      1.000000   35.000000            1.000000    0.000000   31.387500
max      1.000000   80.000000            8.000000    5.000000  512.329200

In [275]:
# 결측치
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "Age": [25, np.nan, 35, 40, np.nan],
    "Salary": [50000, 60000, np.nan, 80000, 90000],
    "Department": ["HR", "Finance", np.nan, "IT", "Marketing"]
}
df = pd.DataFrame(data)

df.isnull().sum() #True는 1이니까 더해진 개수가 결측치의 개수

df.dropna() #결측치 삭제 -> 원본이 바뀌지는 않음, 결측치 없애려면 새로 저장, 혹은 옵션에 inplace = True,, 권장 x

df.fillna('누락') #원본 변하지 않음!!

      Name   Age   Salary Department
0    Alice  25.0  50000.0         HR
1      Bob    누락  60000.0    Finance
2  Charlie  35.0       누락         누락
3    David  40.0  80000.0         IT
4      Eva    누락  90000.0  Marketing